#!/usr/bin/python
# -*- coding: gbk -*-
from EmQuantAPI import *
import pandas as pd
import industry_funtion as ex
import HS300 as hs

#低波 高盈利 指数
#基于申万二级分类
#综合得分 = 0.25*波动率倒数 0.5*盈利概率 0.25*平均盈利
#前100名 流动市值加权 每年调整一次

c.start("UserName=em_niuguoyin,PassWord=em1818")
#申万二级行业指数
#code = '801012.SWI,801014.SWI,801015.SWI,801016.SWI,801017.SWI,801018.SWI,801032.SWI,801033.SWI,801034.SWI,801036.SWI,801037.SWI,801038.SWI,801039.SWI,801043.SWI,801044.SWI,801045.SWI,801051.SWI,801053.SWI,801054.SWI,801055.SWI,801056.SWI,801072.SWI,801074.SWI,801076.SWI,801077.SWI,801078.SWI,801081.SWI,801082.SWI,801083.SWI,801084.SWI,801085.SWI,801086.SWI,801092.SWI,801093.SWI,801095.SWI,801096.SWI,801101.SWI,801102.SWI,801103.SWI,801104.SWI,801111.SWI,801112.SWI,801113.SWI,801114.SWI,801115.SWI,801116.SWI,801124.SWI,801125.SWI,801126.SWI,801127.SWI,801128.SWI,801129.SWI,801131.SWI,801132.SWI,801133.SWI,801141.SWI,801142.SWI,801143.SWI,801145.SWI,801151.SWI,801152.SWI,801153.SWI,801154.SWI,801155.SWI,801156.SWI,801161.SWI,801163.SWI,801178.SWI,801179.SWI,801181.SWI,801183.SWI,801191.SWI,801193.SWI,801194.SWI,801202.SWI,801203.SWI,801204.SWI,801206.SWI,801218.SWI,801219.SWI,801223.SWI,801231.SWI,801711.SWI,801712.SWI,801713.SWI,801721.SWI,801722.SWI,801723.SWI,801724.SWI,801726.SWI,801731.SWI,801733.SWI,801735.SWI,801736.SWI,801737.SWI,801738.SWI,801741.SWI,801742.SWI,801743.SWI,801744.SWI,801745.SWI,801764.SWI,801765.SWI,801766.SWI,801767.SWI,801769.SWI,801782.SWI,801783.SWI,801784.SWI,801785.SWI,801881.SWI,801951.SWI,801952.SWI,801962.SWI,801963.SWI,801971.SWI,801972.SWI,801981.SWI,801982.SWI,801991.SWI,801992.SWI,801993.SWI,801994.SWI,801995.SWI'
#code = code.split(',')
#dic_name = ex.EtoDic('industry.xlsx', '申万二级代码', '申万二级名称')

#沪深300
code300 =  ['000001.SZ', '平安银行', '000002.SZ', '万科A', '000063.SZ', '中兴通讯', '000069.SZ', '华侨城A', '000100.SZ', 'TCL科技', '000157.SZ', '中联重科', '000166.SZ', '申万宏源', '000301.SZ', '东方盛虹', '000333.SZ', '美的集团', '000338.SZ', '潍柴动力', '000408.SZ', '藏格矿业', '000425.SZ', '徐工机械', '000538.SZ', '云南白药', '000568.SZ', '泸州老窖', '000596.SZ', '古井贡酒', '000617.SZ', '中油资本', '000625.SZ', '长安汽车', '000651.SZ', '格力电器', '000661.SZ', '长春高新', '000708.SZ', '中信特钢', '000723.SZ', '美锦能源', '000725.SZ', '京东方A', '000733.SZ', '振华科技', '000768.SZ', '中航西飞', '000776.SZ', '广发证券', '000786.SZ', '北新建材', '000792.SZ', '盐湖股份', '000800.SZ', '一汽解放', '000858.SZ', '五粮液', '000876.SZ', '新希望', '000877.SZ', '天山股份', '000895.SZ', '双汇发展', '000938.SZ', '紫光股份', '000963.SZ', '华东医药', '000977.SZ', '浪潮信息', '000983.SZ', '山西焦煤', '001289.SZ', '龙源电力', '001979.SZ', '招商蛇口', '002001.SZ', '新和成', '002007.SZ', '华兰生物', '002027.SZ', '分众传媒', '002049.SZ', '紫光国微', '002050.SZ', '三花智控', '002064.SZ', '华峰化学', '002074.SZ', '国轩高科', '002120.SZ', '韵达股份', '002129.SZ', 'TCL中环', '002142.SZ', '宁波银行', '002179.SZ', '中航光电', '002180.SZ', '纳思达', '002202.SZ', '金风科技', '002230.SZ', '科大讯飞', '002236.SZ', '大华股份', '002241.SZ', '歌尔股份', '002252.SZ', '上海莱士', '002271.SZ', '东方雨虹', '002304.SZ', '洋河股份', '002311.SZ', '海大集团', '002352.SZ', '顺丰控股', '002371.SZ', '北方华创', '002410.SZ', '广联达', '002414.SZ', '高德红外', '002415.SZ', '海康威视', '002459.SZ', '晶澳科技', '002460.SZ', '赣锋锂业', '002466.SZ', '天齐锂业', '002475.SZ', '立讯精密', '002493.SZ', '荣盛石化', '002555.SZ', '三七互娱', '002594.SZ', '比亚迪', '002601.SZ', '龙佰集团', '002648.SZ', '卫星化学', '002709.SZ', '天赐材料', '002714.SZ', '牧原股份', '002736.SZ', '国信证券', '002756.SZ', '永兴材料', '002812.SZ', '恩捷股份', '002821.SZ', '凯莱英', '002841.SZ', '视源股份', '002916.SZ', '深南电路', '002920.SZ', '德赛西威', '002938.SZ', '鹏鼎控股', '003816.SZ', '中国广核', '300014.SZ', '亿纬锂能', '300015.SZ', '爱尔眼科', '300033.SZ', '同花顺', '300059.SZ', '东方财富', '300122.SZ', '智飞生物', '300124.SZ', '汇川技术', '300142.SZ', '沃森生物', '300207.SZ', '欣旺达', '300223.SZ', '北京君正', '300274.SZ', '阳光电源', '300316.SZ', '晶盛机电', '300347.SZ', '泰格医药', '300408.SZ', '三环集团', '300413.SZ', '芒果超媒', '300433.SZ', '蓝思科技', '300450.SZ', '先导智能', '300454.SZ', '深信服', '300496.SZ', '中科创达', '300498.SZ', '温氏股份', '300601.SZ', '康泰生物', '300628.SZ', '亿联网络', '300661.SZ', '圣邦股份', '300750.SZ', '宁德时代', '300751.SZ', '迈为股份', '300759.SZ', '康龙化成', '300760.SZ', '迈瑞医疗', '300763.SZ', '锦浪科技', '300769.SZ', '德方纳米', '300782.SZ', '卓胜微', '300896.SZ', '爱美客', '300919.SZ', '中伟股份', '300957.SZ', '贝泰妮', '300979.SZ', '华利集团', '300999.SZ', '金龙鱼', '600000.SH', '浦发银行', '600009.SH', '上海机场', '600010.SH', '包钢股份', '600011.SH', '华能国际', '600015.SH', '华夏银行', '600016.SH', '民生银行', '600018.SH', '上港集团', '600019.SH', '宝钢股份', '600025.SH', '华能水电', '600028.SH', '中国石化', '600029.SH', '南方航空', '600030.SH', '中信证券', '600031.SH', '三一重工', '600036.SH', '招商银行', '600039.SH', '四川路桥', '600048.SH', '保利发展', '600050.SH', '中国联通', '600061.SH', '国投资本', '600085.SH', '同仁堂', '600089.SH', '特变电工', '600104.SH', '上汽集团', '600111.SH', '北方稀土', '600115.SH', '中国东航', '600132.SH', '重庆啤酒', '600150.SH', '中国船舶', '600176.SH', '中国巨石', '600183.SH', '生益科技', '600188.SH', '兖矿能源', '600196.SH', '复星医药', '600219.SH', '南山铝业', '600233.SH', '圆通速递', '600276.SH', '恒瑞医药', '600309.SH', '万华化学', '600332.SH', '白云山', '600346.SH', '恒力石化', '600362.SH', '江西铜业', '600383.SH', '金地集团', '600406.SH', '国电南瑞', '600426.SH', '华鲁恒升', '600436.SH', '片仔癀', '600438.SH', '通威股份', '600460.SH', '士兰微', '600519.SH', '贵州茅台', '600547.SH', '山东黄金', '600570.SH', '恒生电子', '600584.SH', '长电科技', '600585.SH', '海螺水泥', '600588.SH', '用友网络', '600600.SH', '青岛啤酒', '600606.SH', '绿地控股', '600660.SH', '福耀玻璃', '600674.SH', '川投能源', '600690.SH', '海尔智家', '600732.SH', '爱旭股份', '600741.SH', '华域汽车', '600745.SH', '闻泰科技', '600754.SH', '锦江酒店', '600760.SH', '中航沈飞', '600763.SH', '通策医疗', '600795.SH', '国电电力', '600803.SH', '新奥股份', '600809.SH', '山西汾酒', '600837.SH', '海通证券', '600845.SH', '宝信软件', '600875.SH', '东方电气', '600884.SH', '杉杉股份', '600886.SH', '国投电力', '600887.SH', '伊利股份', '600893.SH', '航发动力', '600900.SH', '长江电力', '600905.SH', '三峡能源', '600918.SH', '中泰证券', '600919.SH', '江苏银行', '600926.SH', '杭州银行', '600941.SH', '中国移动', '600958.SH', '东方证券', '600989.SH', '宝丰能源', '600999.SH', '招商证券', '601006.SH', '大秦铁路', '601009.SH', '南京银行', '601012.SH', '隆基绿能', '601021.SH', '春秋航空', '601066.SH', '中信建投', '601088.SH', '中国神华', '601100.SH', '恒立液压', '601111.SH', '中国国航', '601117.SH', '中国化学', '601138.SH', '工业富联', '601155.SH', '新城控股', '601166.SH', '兴业银行', '601169.SH', '北京银行', '601186.SH', '中国铁建', '601211.SH', '国泰君安', '601216.SH', '君正集团', '601225.SH', '陕西煤业', '601229.SH', '上海银行', '601236.SH', '红塔证券', '601238.SH', '广汽集团', '601288.SH', '农业银行', '601318.SH', '中国平安', '601319.SH', '中国人保', '601328.SH', '交通银行', '601336.SH', '新华保险', '601360.SH', '三六零', '601377.SH', '兴业证券', '601390.SH', '中国中铁', '601398.SH', '工商银行', '601600.SH', '中国铝业', '601601.SH', '中国太保', '601607.SH', '上海医药', '601615.SH', '明阳智能', '601618.SH', '中国中冶', '601628.SH', '中国人寿', '601633.SH', '长城汽车', '601658.SH', '邮储银行', '601668.SH', '中国建筑', '601669.SH', '中国电建', '601688.SH', '华泰证券', '601689.SH', '拓普集团', '601698.SH', '中国卫通', '601699.SH', '潞安环能', '601728.SH', '中国电信', '601766.SH', '中国中车', '601788.SH', '光大证券', '601799.SH', '星宇股份', '601800.SH', '中国交建', '601808.SH', '中海油服', '601816.SH', '京沪高铁', '601818.SH', '光大银行', '601838.SH', '成都银行', '601857.SH', '中国石油', '601865.SH', '福莱特', '601868.SH', '中国能建', '601872.SH', '招商轮船', '601877.SH', '正泰电器', '601878.SH', '浙商证券', '601881.SH', '中国银河', '601888.SH', '中国中免', '601898.SH', '中煤能源', '601899.SH', '紫金矿业', '601901.SH', '方正证券', '601919.SH', '中远海控', '601939.SH', '建设银行', '601985.SH', '中国核电', '601988.SH', '中国银行', '601989.SH', '中国重工', '601995.SH', '中金公司', '601998.SH', '中信银行', '603019.SH', '中科曙光', '603185.SH', '弘元绿能', '603195.SH', '公牛集团', '603259.SH', '药明康德', '603260.SH', '合盛硅业', '603288.SH', '海天味业', '603290.SH', '斯达半导', '603369.SH', '今世缘', '603392.SH', '万泰生物', '603486.SH', '科沃斯', '603501.SH', '韦尔股份', '603659.SH', '璞泰来', '603799.SH', '华友钴业', '603806.SH', '福斯特', '603833.SH', '欧派家居', '603899.SH', '晨光股份', '603986.SH', '兆易创新', '603993.SH', '洛阳钼业', '605117.SH', '德业股份', '605499.SH', '东鹏饮料', '688005.SH', '容百科技', '688008.SH', '澜起科技', '688012.SH', '中微公司', '688036.SH', '传音控股', '688065.SH', '凯赛生物', '688111.SH', '金山办公', '688126.SH', '沪硅产业', '688187.SH', '时代电气', '688223.SH', '晶科能源', '688303.SH', '大全能源', '688363.SH', '华熙生物', '688396.SH', '华润微', '688561.SH', '奇安信', '688599.SH', '天合光能', '688981.SH', '中芯国际']
dic_name = hs.list_to_dic(code300)
code = hs.pop_list_CH(code300)

dic_sort = {}
list = []

for k in code:
    Sum, count, aver, reverse_vola = ex.roll(k)
    probility = Sum/count
    list.append((dic_name[k], k, Sum, count, probility*100, aver*100, reverse_vola))


old_frame = pd.DataFrame(list, columns=['行业名称(申万)', '行业代码', '3年内轮动购买盈利天数', '可计算样本天数为', '盈利概率(%)', '平均盈利(%)', '年化波动率(%)'])
aver_aver, aver_std = ex.to_stan(old_frame, '平均盈利(%)')
vola_aver, vola_std = ex.to_stan(old_frame, '年化波动率(%)')
pro_aver, pro_std = ex.to_stan(old_frame, '盈利概率(%)')

for cod in code:
    for tuple in list:
        if cod in tuple:
            Z_aver = ex.standard(tuple[5], aver_aver, aver_std)
            Z_pro = ex.standard(tuple[4], pro_aver, pro_std)
            Z_vola = ex.standard(tuple[6], pro_aver, pro_std)
            Z_Score = Z_aver * 0.25 + Z_pro * 0.5 + Z_vola * 0.25
            dic_sort[cod] = Z_Score
        else:
            pass

dic = ex.sort(dic_sort)
dic = dict(dic)

new_list = []
for cod in dic:
    for tuple in list:
        if cod not in tuple:
            pass
        else:
            print("行业名称：%s \t行业代码：%s \t3年内轮动购买盈利天数：%d \t可计算样本天数为：%d \t盈利概率：%.3f %% \t平均盈利：%.3f %% \t年化波动率：%f %%  \t综合得分：%.2f" % (tuple[0],tuple[1], tuple[2], tuple[3],tuple[4], tuple[5], 1/tuple[6], dic_sort[cod]))
            new_list.append((tuple[0],tuple[1], tuple[2], tuple[3],tuple[4], tuple[5], 1/tuple[6], dic_sort[cod]))


df = pd.DataFrame(new_list, columns=['行业名称(申万)', '行业代码', '五年内轮动购买盈利天数', '可计算样本天数为', '盈利概率(%)', '平均盈利(%)', '年化波动率(%)', '综合得分'])
df.set_index('行业名称(申万）', inplace=True)
#df.to_excel('申万二级行业240敲入数据.xlsx')
df.to_excel('沪深300——120敲入数据.xlsx')


    # Z_aver = ex.standard()
    # Z_pro = ex.standard()
    # Z_vola = ex.standard()

    #dic_sort[k] = aver * 0.25 + probility * 0.5 + vola * 0.25